tameson_delivery_ups/D2R WebService shipping AP.xml

<envr:Envelope
  xmlns:auth="http://www.ups.com/schema/xpci/1.0/auth"
  xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/04/secext"
  xmlns:envr="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:upsa="http://www.ups.com/XMLSchema/XOLTWS/upssa/v1.0"
  xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:wsf="http://www.ups.com/schema/wsf"
>
	<envr:Header>
		<wsse:Security>
			<wsse:UsernameToken>
				<wsse:Username>User ID</wsse:Username>
				<wsse:Password>Password</wsse:Password>
			</wsse:UsernameToken>
			<upsa:UPSServiceAccessToken>
				<upsa:AccessLicenseNumber>License</upsa:AccessLicenseNumber>
			</upsa:UPSServiceAccessToken>
		</wsse:Security>

	</envr:Header>
	<envr:Body>
		<ship:ShipmentRequest
      xsi:schemaLocation="http://www.ups.com/XMLSchema/XOLTWS/Ship/v1.0"
      xmlns:ship="http://www.ups.com/XMLSchema/XOLTWS/Ship/v1.0"
      xmlns:ifs="http://www.ups.com/XMLSchema/XOLTWS/IF/v1.0"
    >
			<common:Request>
				<common:RequestOption>validate</common:RequestOption>
				<common:TransactionReference>
					<common:CustomerContext />
				</common:TransactionReference>
			</common:Request>
			<ship:Shipment>
				<ship:Description>Ship Description</ship:Description>
					<ship:Shipper>
					<ship:Name>UPS Neuss</ship:Name>
					<ship:AttentionName>Juanma Saiz</ship:AttentionName>
					<ship:TaxIdentificationNumber>123456</ship:TaxIdentificationNumber>
					<ship:Phone>
						<ship:Number>021311548916</ship:Number>
						<ship:Extension>1</ship:Extension>
					</ship:Phone>

					<ship:ShipperNumber>UPS account</ship:ShipperNumber>
					<ship:FaxNumber />
					<ship:Address>
						<ship:AddressLine>str.1</ship:AddressLine>
						<ship:AddressLine>address lin2</ship:AddressLine>
						<ship:AddressLine>address lin3</ship:AddressLine>
						<ship:City>Neuss</ship:City>
						<ship:StateProvinceCode />
						<ship:PostalCode>zipcode</ship:PostalCode>
						<ship:CountryCode>De</ship:CountryCode>
					</ship:Address>
				</ship:Shipper>
				<ship:ShipTo>
					<ship:Name>UPS Alvento</ship:Name>
					<ship:AttentionName>Josepe</ship:AttentionName>
					<ship:Phone>
						<ship:Number>01709221966</ship:Number>
					</ship:Phone>
					<ship:Address>
						<ship:AddressLine>Via de los poblados 1</ship:AddressLine>
						<ship:City>Via de los poblados 1</ship:City>
						<ship:StateProvinceCode />
						<ship:PostalCode>28031</ship:PostalCode>
						<ship:CountryCode>ES</ship:CountryCode>
					</ship:Address>
				</ship:ShipTo>
				<ship:AlternateDeliveryAddress>
					<ship:Name>Papeleria Margo</ship:Name>
					<ship:AttentionName>Papelaria Margo</ship:AttentionName>
					<ship:UPSAccessPointID />
					<ship:Address>
						<ship:AddressLine>C/ PENARANDA DE BRACAMONTE, 22 </ship:AddressLine>
						<ship:AddressLine />
						<ship:City>Madrid</ship:City>
						<ship:StateProvinceCode />
						<ship:PostalCode>28051</ship:PostalCode>
						<ship:CountryCode>ES</ship:CountryCode>
					</ship:Address>
				</ship:AlternateDeliveryAddress>

				<ship:PaymentInformation>
					<ship:ShipmentCharge>
						<ship:Type>01</ship:Type>
						<ship:BillShipper>
						<ship:AccountNumber>UPS account</ship:AccountNumber>
						</ship:BillShipper>
					</ship:ShipmentCharge>
				</ship:PaymentInformation>
				<ship:ReferenceNumber>
					<ship:Code />
					<ship:Value>TEST ACCOUNT</ship:Value>
				</ship:ReferenceNumber>
				<ship:Service>
					<ship:Code>11</ship:Code>
					<ship:Description>Standard</ship:Description>
				</ship:Service>
				<ship:Package>
					<ship:Description />
					<ship:Packaging>
						<ship:Code>02</ship:Code>
						<ship:Description>Test</ship:Description>
					</ship:Packaging>
					<ship:Dimensions>
						<ship:UnitOfMeasurement>
							<ship:Code>CM</ship:Code>
							<ship:Description>Zentimeter</ship:Description>
						</ship:UnitOfMeasurement>
						<ship:Length>7</ship:Length>
						<ship:Width>5</ship:Width>
						<ship:Height>2</ship:Height>
					</ship:Dimensions>
					<ship:PackageWeight>
						<ship:UnitOfMeasurement>
							<ship:Code>KGS</ship:Code>
							<ship:Description>Kilo</ship:Description>
						</ship:UnitOfMeasurement>
						<ship:Weight>1</ship:Weight>
					</ship:PackageWeight>
					<ship:AdditionalHandlingIndicator />
				</ship:Package>

				<ship:ShipmentIndicationType>
					<ship:Code>01</ship:Code>
					<ship:Description>DirectToRetail</ship:Description>
				</ship:ShipmentIndicationType>
				<ship:ShipmentServiceOptions>

					<ship:Notification> <!-- Max 3 -->
						<ship:NotificationCode>012</ship:NotificationCode>
						<ship:EMail>
							<ship:EMailAddress>email</ship:EMailAddress>
						</ship:EMail>

						<ship:TextMessage>
							<ship:PhoneNumber>619500820</ship:PhoneNumber><!--Max.15 Zeichen-->
						</ship:TextMessage>
						<ship:Locale>
							<ship:Language>DEU</ship:Language>
							<ship:Dialect>97</ship:Dialect>
						</ship:Locale>
					</ship:Notification>
				</ship:ShipmentServiceOptions>
			</ship:Shipment>
			<ship:LabelSpecification>
				<ship:LabelImageFormat>
					<ship:Code>GIF</ship:Code>
					<ship:Description>GIF</ship:Description>
				</ship:LabelImageFormat>
			<ship:LabelStockSize>
					<ship:Height>8</ship:Height>
					<ship:Width>4</ship:Width>
				</ship:LabelStockSize>
			</ship:LabelSpecification>
		</ship:ShipmentRequest>
	</envr:Body>
</envr:Envelope>
